Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Then you create an instance that implements `FlightService`. You should not use it directly at this stage because access to it is not being managed by the STM subsystem.
ja_jp: 次に、 `FlightService` を実装したインスタンスを作成します。この段階では、STM サブシステムによってアクセスが管理されていないため、直接使用してはいけません。

source: Then you get the information to store in the event from the `IdProducer` object's `getTraceId()` and `getSpanId()`.
ja_jp: 次に、 `IdProducer` オブジェクトの `getTraceId()` と `getSpanId()` からイベントに保存する情報を取得します。

source: Then you must create a pull request adding a `your-extension.yaml` file in the `extensions/` directory in the link:https://github.com/quarkusio/quarkus-extension-catalog[Quarkus Extension Catalog]. The YAML must have the following structure:
ja_jp: それから、 link:https://github.com/quarkusio/quarkus-extension-catalog[Quarkus Extension Catalog]の `extensions/` ディレクトリに `your-extension.yaml` ファイルを追加するプルリクエストを作成する必要があります。YAMLは以下のような構造になっていなければなりません。

source: Then you need to add to your `pom.xml` the Cloud SQL JDBC library that provides the additional connectivity to Cloud SQL. For PostgreSQL you will need to include the following dependency:
ja_jp: 次に、Cloud SQLへの追加の接続性を提供するCloud SQL JDBCライブラリを `pom.xml` に追加する必要があります。PostgreSQLの場合は、以下の依存関係を追加する必要があります。

source: Then you need to create a `CodecProvider` to link this `Codec` to the `Fruit` class.
ja_jp: そして、この `Codec` を `Fruit` クラスにリンクさせるための `CodecProvider` を作成する必要があります。

source: Then you need to create a fluentd configuration file inside `$HOME/fluentd/fluent.conf`
ja_jp: 次に、 `$HOME/fluentd/fluent.conf` の中にfluentd 設定ファイルを作成する必要があります

source: Then you should add the following settings to your `application.properties`:
ja_jp: 次に、 `application.properties` に以下の設定を追加する必要があります。

source: Then you will be able to create a Fabric8 Kubernetes Client object able to perform many kube tasks as detailed part of this https://github.com/fabric8io/kubernetes-client/blob/main/doc/CHEATSHEET.md[cheat sheet].
ja_jp: その後、この link:https://github.com/fabric8io/kubernetes-client/blob/main/doc/CHEATSHEET.md[チートシート] の詳細部分にあるように、多くのkubeタスクを実行できるFabric8 Kubernetes Clientオブジェクトを作成できるようになります。

source: Then you will be able to use `gcloud functions deploy` command to deploy your function to Google Cloud.
ja_jp: これで `gcloud beta functions deploy` コマンドを使って Google Cloud に関数をデプロイすることができるようになります。

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud, the `gcloud` command will be different depending from which event you want to be triggered.
ja_jp: その後、 `gcloud` を使用して Google Cloud に関数をデプロイすることができるようになります。 `gcloud` コマンドは、どのイベントをトリガーにしたいかによって異なります。

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud.
ja_jp: そして、 `gcloud` を使って、機能を Google Cloud にデプロイすることができるようになります。

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud. The `gcloud` command will be different depending on which event triggers your function.
ja_jp: これで、 `gcloud` を使って関数を Google Cloud にデプロイすることができるようになります。 `gcloud` コマンドは、どのイベントが関数のトリガーになるかによって異なります。

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud. The `gcloud` command will be different depending on which event you want to trigger.
ja_jp: その後、 `gcloud` を使用して Google Cloud に関数をデプロイすることができるようになります。 `gcloud` コマンドは、どのイベントをトリガーにしたいかによって異なります。

source: Then you would be able to use Maven to build and deploy your application to App Engine via `mvn clean package appengine:deploy`.
ja_jp: その後、Mavenを使用してアプリケーションをビルドし、 `mvn clean package appengine:deploy` を経由してApp Engineにデプロイすることができます。

source: Then, Stork will use your implementation to locate the `my-service` service.
ja_jp: そして、Storkはあなたの実装を使って、 `my-service` のサービスを探します。

source: Then, Stork will use your implementation to select the `my-service` service instance.
ja_jp: その後、Storkはあなたの実装を使って `my-service` のサービスインスタンスを選択します。

source: Then, access your named mailers by using the `@MailerName` CDI qualifier:
ja_jp: そして、 `@MailerName` CDI修飾子を使用して、名前付きメーラーにアクセスします:

source: Then, add a new build step into the extension processor class that returns a `DevServicesResultBuildItem`. Here, the https://hub.docker.com/_/hello-world[`hello-world`] image is used, but you should set up the right image for your service.
ja_jp: 次に、 `DevServicesResultBuildItem` を返す新しいビルドステップをエクステンションプロセッサクラスに追加します。 link:https://hub.docker.com/_/hello-world[hello-world] イメージを使いますが、あなたのサービスに適したイメージを設定してください。

source: Then, add the `eu.maveniverse.maven.nisse:plugin3` and the `protobuf-maven-plugin` configuration to the `build` section:
ja_jp: 次に、 `build` セクションに `eu.maveniverse.maven.nisse:plugin3` と `protobuf-maven-plugin` の設定を追加します：

source: Then, add the `os-maven-plugin` extension and the `protobuf-maven-plugin` configuration to the `build` section:
ja_jp: 次に、 `os-maven-plugin` エクステンションと `protobuf-maven-plugin` 設定を `build` セクションに追加します。

source: Then, add the endpoint to get all fruits from the backend:
ja_jp: 次に、バックエンドからすべての fruits を取得するためのエンドポイントを追加します。

source: Then, add to the `build` section the `os-maven-plugin` extension and the `protobuf-maven-plugin` configuration.
ja_jp: そして、 `build` セクションに `os-maven-plugin` のエクステンションと `protobuf-maven-plugin` の設定を追加します。

source: Then, add to your `application.properties` file:
ja_jp: そして `application.properties` ファイルに追加します。

source: Then, at the end of your documentation, include the extensive documentation:
ja_jp: そして、文書の最後には、エクステンションのドキュメントをインクルードしてください。

source: Then, attach your debugger to `localhost:5005`.
ja_jp: 次に、デバッガーを `localhost:5005` にアタッチします。

source: Then, build your container as you would do usually. For example, if you are using Maven, run:
ja_jp: 次に、通常と同じようにコンテナーをビルドします。 例えば、Maven を使用している場合、次を実行します。

source: Then, call `http://localhost:8080/weather?city=Raleigh` from a browser. After six long seconds, the application will answer something like this:
ja_jp: 次に、ブラウザから `http://localhost:8080/weather?city=Raleigh` を呼び出します。6秒ほど長い時間が経過すると、アプリケーションはこのような回答をします:

source: Then, click on __Generate your application__, download the project as a zip file, unzip it, and load it in your favorite IDE.
ja_jp: そして、 _Generate your application_ をクリックして、プロジェクトをzipファイルとしてダウンロードし、解凍して、お気に入りのIDEにロードします。

source: Then, configure Google OIDC properties:
ja_jp: 次に、Google OIDC プロパティーを設定します。

source: Then, configure the Maven Surefire plugin as follows (and similarly the Maven Failsafe plugin when testing in native image):
ja_jp: 次に、Maven Surefire プラグインを次のように設定します (ネイティブイメージでテストする場合は、Maven Failsafe プラグインを同様に設定します)。

source: Then, create a Quarkus Test Resource as follows:
ja_jp: そして、以下のように Quarkus Test Resource を作成します。

source: Then, create a `.gcloudignore` file to tell gcloud which files should be not be uploaded for Cloud Build, without it, it defaults to `.gitignore` that usually exclude the target directory where you packaged application has been created.
ja_jp: 次に、Cloud Buildのためにアップロードすべきでないファイルをgcloudに伝えるための `.gcloudignore` ファイルを作成します。これがない場合、デフォルトは `.gitignore` で、通常はパッケージ化されたアプリケーションが作成されたターゲットディレクトリーを除外します。

source: Then, create an interface method that corresponds to the call and make it return the `FormDto`:
ja_jp: 次に、呼び出しに対応するインターフェイスメソッドを作成し、 `FormDto` を返すようにします。

source: Then, create the native executable with:
ja_jp: そして、ネイティブ実行可能ファイルを作成します。

source: Then, creates a new JAX-RS resource with the following content:
ja_jp: そして、以下の内容の JAX-RS リソースを新規に作成します。

source: Then, creates a new Jakarta REST resource with the following content:
ja_jp: 次に、以下の内容で新しいJakarta RESTリソースを作成します:

source: Then, deploy the verticle instances with:
ja_jp: そして、Verticleインスタンスをデプロイします。

source: Then, deploy your verticle as follows:
ja_jp: そして、verticleを次のようにデプロイします:

source: Then, execute your native executable with: `./target/getting-started-amqp-1.0.0-SNAPSHOT-runner`, and you get a Quarkus application using AMQP starting in a few milliseconds and consuming a ridiculous amount of memory: only 33Mb after 100 ingested records!
ja_jp: そして、 `./target/getting-started-amqp-1.0.0-SNAPSHOT-runner` でネイティブ実行可能ファイルを実行すると、AMQPを使用したQuarkusアプリケーションが数ミリ秒で起動し、とんでもない量:100レコードを取り込んでもたったの33MB!になります。

source: Then, execute your native executable with: `./target/getting-started-kafka-1.0.0-SNAPSHOT-runner`, and you get a Quarkus application using Kafka starting in a few milliseconds and consuming a ridiculous amount of memory: less than 30Mb after 100 ingested records!
ja_jp: そして、 `./target/getting-started-kafka-1.0.0-SNAPSHOT-runner` でネイティブ実行可能ファイルを実行すると、Kafkaを使用したQuarkusアプリケーションが数ミリ秒で起動し、消費するメモリー量はとんでもない量:100レコードを取り込んでも30MB未満!になります。

source: Then, for example, to set the maximum concurrency of this method down to 30, set using the config property `smallrye.messaging.worker.my-worker.max-concurrency=30`.
ja_jp: 次に、たとえば、このメソッドの最大同時実行数を 30 に設定するには、設定プロパティー `smallrye.messaging.worker.my-worker.max-concurrency=30` を使用して設定します。

source: Then, from inside the tools container we execute:
ja_jp: 次に、ツールコンテナー内から以下を実行します。

source: Then, go to the root of the project and run the Docker container we have just created as:
ja_jp: 次に、プロジェクトの root に移動し、先ほど作成した Docker コンテナーを以下のように実行します。

source: Then, if you didn't delete the generated native executable, you can build the docker image with:
ja_jp: あとは、生成されたネイティブ実行可能ファイルを削除していなければ、dockerイメージを使ってビルドします:

source: Then, in a browser, open http://localhost:8080. You should get something like:
ja_jp: 次に、ブラウザで http://localhost:8080 を開きます。 次のようなメッセージが表示されるはずです：

source: Then, in a terminal, run:
ja_jp: そして、ターミナルで、次を実行します。

source: Then, in the `VertxResource` file add the following method:
ja_jp: そして、 `VertxResource` ファイルに以下のメソッドを追加します。

source: Then, in the `application.properties`, add:
ja_jp: 次に、 `application.properties` に以下を追加します。

source: Then, in the application configuration, add:
ja_jp: そして、アプリケーションの設定で、以下を追加します。

source: Then, in your application configuration, enable the compression by configuring the _compression level_ you want:
ja_jp: アプリケーションの設定で、必要な _圧縮レベル_ を設定して圧縮を有効にします。

source: Then, in your test you can simply use `@InjectMock` to create and inject a mock:
ja_jp: 次に、テストで `@InjectMock` を使用して、モックを作成して挿入できます。

source: Then, invoke the endpoint using:
ja_jp: そして、次のようにエンドポイントを呼び出します：

source: Then, launch the application using:
ja_jp: そして、アプリケーションを起動します。

source: Then, launch the components that compose the EFK Stack:
ja_jp: 次に、EFKスタックを構成するコンポーネントを起動します:

source: Then, let's commit this change:
ja_jp: 次に、この変更をコミットします。

source: Then, let's use the `@Indexed` annotation to register our `Author` entity as part of the full text index.
ja_jp: 次に、 `@Indexed` アノテーションを使用して、 `Author` エンティティーをフルテキストインデックスの一部として登録します。

source: Then, one day, I took a shower, and I had this idea:
ja_jp: そんなある日、シャワーを浴びているときに、あるアイデアが浮かびました。

source: Then, open http://localhost:8080/hello/quarkus in a browser, and you should get `Hello quarkus`!
ja_jp: そして、ブラウザで http://localhost:8080/hello/quarkus を開くと、 `Hello quarkus` と表示されるはずです!

source: Then, open the `src/main/resources/application.properties` file and add:
ja_jp: 次に、 `src/main/resources/application.properties` ファイルを開き追加します:

source: Then, open the `src/test/java/org/acme/quickstart/GreetingResourceIT.java`. It contains:
ja_jp: 次に、 `src/test/java/org/acme/quickstart/GreetingResourceIT.java` を開きます。次の内容が含まれています:

source: Then, open the `src/test/java/org/acme/quickstart/NativeGreetingResourceIT.java`. It contains:
ja_jp: 次に、 `src/test/java/org/acme/quickstart/NativeGreetingResourceIT.java` を開きます。次の内容が含まれています:

source: Then, open your browser to http://localhost:8080/:
ja_jp: そして、ブラウザで http://localhost:8080/ を開いてください:

source: Then, package the application:
ja_jp: 次に、アプリケーションをパッケージ化します:

source: Then, rebuild your native executable. This setting forces the native compilation to use an older instruction set, increasing the chance of compatibility.
ja_jp: その後、ネイティブ実行可能ファイルをリビルドします。 この設定により、ネイティブ・コンパイルは古い命令セットを使用するようになり、互換性の可能性が高まります。

source: Then, run it:
ja_jp: そして、実行してみてください:

source: Then, run the application using:
ja_jp: そして、アプリケーションを次のように実行します:

source: Then, run the executable through perf, *indicating that the call graph is dwarf*:
ja_jp: 次に、実行ファイルを perf で実行すると、 *コールグラフが dwarf であることがわかります*。

source: Then, setting the exporter to `logging` in the `application.properties` file:
ja_jp: 次に、 `application.properties` ファイルでエクスポーターを `logging` に設定します。

source: Then, the `{#cached}` section can be used in a template:
ja_jp: その後、{#cached}` セクションをテンプレート内で使用できます。

source: Then, update `application.properties` to get all the CDI producers provided by `smallrye-jwt` included as follows:
ja_jp: さらに、 `application.properties` を更新して、 `smallrye-jwt` によって提供されるすべての CDI プロデューサーを次のように含めます。

source: Then, use Cloud Build to build your image, it will upload to a Google Cloud Storage bucket all the files of your application (except the ones ignored by the `.gcloudignore`file), build your Docker image and push it to Google Container Registry (GCR).
ja_jp: その後、Cloud Buildを使ってイメージをビルドすると、アプリケーションのすべてのファイル(`.gcloudignore`fileで無視されたファイルを除く)をGoogle Cloud Storageバケットにアップロードし、DockerイメージをビルドしてGoogle Container Registry (GCR)にプッシュします。

source: Then, use the `@CacheResult` and other cache annotations as detailed in the xref:cache.adoc[Quarkus Cache guide]:
ja_jp: 次に、xref:cache.adoc[Quarkus キャッシュガイド] に詳述されているように、 `@CacheResult` やその他のキャッシュアノテーションを使用します。

source: Then, use the `@CacheResult` and others cache annotations as explained in the xref:cache.adoc[Quarkus Cache guide]:
ja_jp: その後、 xref:cache.adoc[Quarkus Cacheガイド] で説明されているように、 `@CacheResult` や、その他のキャッシュアノテーションを使用します:

source: Then, use this command to deploy to Google Cloud Functions:
ja_jp: そして、このコマンドを使って Google Cloud Functions にデプロイします。

source: Then, using the xref:deploying-to-kubernetes.adoc#service_binding[Kubernetes Service Binding] extension, you can configure the Quarkus application to generate `ServiceBinding` resources for those services:
ja_jp: 次に、xref:deploying-to-kubernetes.adoc#service_binding[Kubernetes Service Binding] 拡張を使用して、これらのサービス用の `ServiceBinding` リソースを生成するように Quarkus アプリケーションを構成できます。

source: Then, we can call the tag like this:
ja_jp: そして、以下のようなタグを呼び出すことができます。

source: Then, we need an AMQP broker. In this case we will use an Apache ActiveMQ Artemis server. You can follow the instructions from the https://activemq.apache.org/components/artemis/[Apache Artemis web site] or start a broker via docker using the https://artemiscloud.io/[ArtemisCloud] container image:
ja_jp: 次に、AMQPブローカーが必要です。この場合はActiveMQ Artemisサーバーを使用します。 link:https://activemq.apache.org/components/artemis/[Apache ArtemisのWebサイト] の手順に従うか、 https://artemiscloud.io/[ArtemisCloud]コンテナイメージを使用し、docker経由でブローカーを起動します。

source: Then, we need an AMQP broker. In this case we will use an Apache ActiveMQ Artemis server. You can follow the instructions from the https://activemq.apache.org/components/artemis/[Apache Artemis website] or start a broker via docker using the https://artemiscloud.io/[ArtemisCloud] container image:
ja_jp: 次に、AMQPブローカーが必要です。この場合はActiveMQ Artemisサーバーを使用します。 link:https://activemq.apache.org/components/artemis/[Apache ArtemisのWebサイト] の手順に従うか、 https://artemiscloud.io/[ArtemisCloud] コンテナイメージを使用し、docker経由でブローカーを起動します:

source: Then, we need to implement the `ServiceDiscovery` interface:
ja_jp: 次に、 `ServiceDiscovery` インターフェースを実装する必要があります。

source: Then, we need to start a Redis instance (if you do not have one already) using the following command:
ja_jp: 次に、以下のコマンドを使用してRedisインスタンスを起動する必要があります(すでにインスタンスを持っていない場合)。

source: Then, we ran some benchmarks to assess resource consumption compared to the old version. We were not really worried about startup time. We knew it would be very good. And as long as it stayed in the few seconds window (which we were experiencing on the plain Java version), we were OK. But memory and CPU consumption was another story. The whole exercise was motivated by hopes for some real gains.
ja_jp: そして、いくつかのベンチマークを実行し、旧バージョンと比較してリソース消費量を評価しました。起動時間についてはあまり気にしていませんでした。非常に優れていることはわかっていましたから。起動時間が数秒以内に収まっていれば（プレーンなJavaバージョンで経験していたことですが）、問題ありませんでした。しかし、メモリとCPUの消費は別の話でした。この試みは、実際に何らかの利益が得られることを期待して行われました。

source: Then, we will implement a consumer that will consume and collect messages from the same topic. The collected messages will be then exposed by another resource, `ConsumedMovieResource`, via https://developer.mozilla.org/en-US/docs/Web/API/Server-sent_events/Using_server-sent_events[Server-Sent Events].
ja_jp: 次に、同じトピックからメッセージを消費および収集するコンシューマーを実装します。収集されたメッセージは、 https://developer.mozilla.org/en-US/docs/Web/API/Server-sent_events/Using_server-sent_events[Server-Sent Events] を介して別のリソースである `ConsumedMovieResource` によって公開されます。

source: Then, we will need to parse the contents into a *template definition* Java object. A template definition is an instance of `io.quarkus.qute.Template`.
ja_jp: そして、その内容を *テンプレート定義* Javaオブジェクトにパースする必要があります。テンプレート定義は、 `io.quarkus.qute.Template` のインスタンスです。

source: Then, when you need to log in to that service, instead of typing your password (which doesn't exist, remember?), you press a button on the login form, and the browser will ask you to do something, and then it will send a signature to your service instead of a password. That signature requires the private key that is derived from your authenticator hardware and the target service, and so when your service receives it, it can verify that it corresponds to the signature of the public key you stored as credentials.
ja_jp: 続いて、そのサービスにログインする必要がある場合は、パスワード (存在しませんが) を入力する代わりに、 ログインフォームのボタンを押すと、ブラウザーが何かを尋ねてきて、パスワードの代わりに署名をサービスに送信します。 その署名には、オーセンティケーターハードウェアと対象サービス から得られる秘密鍵が必要なので、サービスがそれを受け取ると、 それが認証情報として保存した公開鍵の署名と一致するかどうかを検証できます。

source: Then, write test code such as this:
ja_jp: 次に、以下のようなテストコードを記述します。

source: Then, you also need to make sure that you are using Java 21+, this can be enforced in your pom.xml file with the following:
ja_jp: 次に、Java 21 以降を使用していることも確認する必要があります。これは、pom.xml ファイルで次のように強制できます。

source: Then, you can choose to build the application manually or delegating that responsibility to `gcloud` or the Google Cloud Maven plugin.
ja_jp: 次に、アプリケーションを手動で構築するか、その責任を `gcloud` または Google Cloud Maven プラグインに任せるかを選択することができます。

source: Then, you can configure the Quarkus application to connect to the broker as follows:
ja_jp: 続いて、以下のようにブローカーに接続するように Quarkus アプリケーションを設定できます。

source: Then, you can configure the Quarkus application to connect to the schema registry as follows:
ja_jp: 続いて、以下のようにスキーマレジストリーに接続するように Quarkus アプリケーションを設定できます。

source: Then, you can create the following resource to create/read/update/delete your Person entity:
ja_jp: そして、次のようなリソースを作成することで、Personエンティティの作成/読み取り/更新/削除が可能になります:

source: Then, you can just launch `gcloud app deploy` in the root of your project, it will upload all your project files (the list can be reduced via the `.gcloudignore` file), package your JAR via Maven (or Gradle) and launch it on App Engine.
ja_jp: 最後に、プロジェクトのルートで `gcloud app deploy` を実行すると、すべてのプロジェクトファイルをアップロードし( `.gcloudignore` ファイルを介してリストを縮小することができます)、Maven(または Gradle)で JAR をパッケージして、App Engine で起動することができます。

source: Then, you can obtain the path of the socket with the following command:
ja_jp: 次に、以下のコマンドで、ソケットのパスを取得します。

source: Then, you can reconstruct the instance using the `mapTo` method
ja_jp: その後、 `mapTo` メソッドを使用してインスタンスを再構築できます。

source: Then, you can use the `OidcClient.accessTokens` method to accept a Map of extra properties and pass the `auth_req_id` parameter to exchange the token authorization code.
ja_jp: さらに、 `OidcClient.accessTokens` メソッドを使用して追加プロパティーの Map を受け入れ、 `auth_req_id` パラメーターを渡してトークン認可コードを交換できます。

source: Then, you can use the `OidcClient.accessTokens` method to accept a Map of extra properties and pass the current `code` and `redirect_uri` parameters to exchange the authorization code for the tokens.
ja_jp: 次に、 `OidcClient.accessTokens` メソッドで追加プロパティーの Map を受け取り、現在の `code` と `redirect_uri` パラメーターを渡して認可コードとトークンを交換することが可能です。

source: Then, you need to build a container image based on the native executable. For this use the corresponding Dockerfile:
ja_jp: 次に、ネイティブ実行可能ファイルに基づいてコンテナーイメージを構築する必要があります。これには、対応する Dockerfile を使用します:

source: Then, you need to create a Fluentd configuration file inside `$HOME/fluentd/fluent.conf`
ja_jp: 次に、Fluentd 設定ファイルを `$HOME/fluentd/fluent.conf` 内に作成する必要があります。

source: Then, you need to create a UDP input in Graylog. You can do it from the Graylog web console (System -> Input -> Select GELF UDP) available at http://localhost:9000 or via the API.
ja_jp: 次に、GraylogでUDP入力を作成する必要があります。これは、 http://localhost:9000 の GraylogのWebコンソール(System → Input → Select GELF UDP)から、 またはAPI経由で行うことができます。

source: Then, you need to create a fluentd configuration file inside `$HOME/fluentd/fluent.conf`
ja_jp: 次に、fluentd設定ファイルを `$HOME/fluentd/fluent.conf` 内に作成する必要があります。

source: Then, you need to enable it in the configuration:
ja_jp: そして、コンフィギュレーションで有効にする必要があります。

source: Then, you should see output similar to the following example:
ja_jp: 次に、以下の例のような出力が表示されるはずです。

source: Then, you will need to create a `src/main/appengine/app.yaml` file, let's keep it minimalistic with only the selected engine:
ja_jp: 次に、 `src/main/appengine/app.yaml` ファイルを作成する必要がありますので、選択したエンジンのみの最低限のものにしておきましょう。

source: Then, your application can generate messages and publish them to the `prices-out` channel. It can use `double` payloads as in the following snippet:
ja_jp: 次に、アプリケーションはメッセージを生成し、それらを `prices-out` チャネルに公開できます。以下のスニペットのように、 `double` ペイロードを使用することができます。

source: Then, your application can receive the `double` payload directly:
ja_jp: すると、アプリケーションが `double` ペイロードを直接受信できるようになります。

source: Then, your application must send `Message<Double>` to the `prices` channel. It can use `double` payloads as in the following snippet:
ja_jp: 次に、アプリケーションは、 `Message<Double>` を `prices` チャネルに送信する必要があります。次のスニペットのように、 `double` ペイロードを使用できます。

source: Then, your endpoint can return `Uni` or `Multi` instances:
ja_jp: そして、エンドポイントは `Uni` や `Multi` のインスタンスを返すことができます。

source: There Quarkus provides a lot of build items that control aspects of the native executable build. This allows for extensions to programmatically perform tasks such as registering classes for reflection or adding static resources to the native executable. Some of these build items are listed below:
ja_jp: そこで Quarkus は、ネイティブの実行可能ビルドの特徴を制御する多くのビルドアイテムを提供します。これによりエクステンションは、リフレクション用のクラスの登録やネイティブ実行可能ファイルへの静的リソースの追加などのタスクをプログラムで実行できます。これらのビルドアイテムの一部を以下に示します。

source: There are 2 APIs:
ja_jp: APIは2つあります:

source: There are 2 `@Blocking` annotations:
ja_jp: `@Blocking` アノテーションは 2 つあります。

source: There are 2 variants of load shedding: pure and priority-based. Pure load shedding rejects all requests when overload is detected. Priority load shedding only rejects a fraction of requests even if overload is detected, based on application-defined criteria. By default, priority load shedding is enabled. It can be disabled by setting `quarkus.load-shedding.priority.enabled` to `false.`
ja_jp: 負荷制限には、純粋なものと優先度ベースの 2 種類があります。純粋な負荷制限は、過負荷が検出されるとすべてのリクエストを拒否します。優先度ベースの負荷制限は、過負荷が検出された場合でも、アプリケーションで定義された基準に基づいてリクエストの一部のみを拒否します。デフォルトでは、優先負荷制限が有効になっています。 `quarkus.load-shedding.priority.enabled` を `false` に設定することで無効にできます。

source: There are 2 ways of customizing priority load shedding:
ja_jp: 優先負荷制限をカスタマイズするには 2 つの方法があります:

source: There are 2 ways to add things to the footer. There easiest is to just expose the log in a BuildItem. Here we expect either a supplier (function) that return a `Flow.Publisher<String>` or a RuntimeValue<SubmissionPublisher<String>>:
ja_jp: フッターに要素を追加する方法は2つあります。最も簡単な方法は、BuildItem でログを公開することです。ここでは、 `Flow.Publisher<String>` を返すサプライヤー (関数) か、 RuntimeValue<SubmissionPublisher<String>> のいずれかを想定しています。

source: There are 3 stages to communicate to a backend during runtime (when the user is running their app in dev mode):
ja_jp: 実行時 (ユーザーが開発モードでアプリケーションを実行しているとき) にバックエンドと通信するには、3つの段階があります。
